# Datos del titanic

In [1]:
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
import numpy as np
import pandas as pd

In [5]:
titanic["survived"] = pd.Categorical(titanic["survived"])

In [6]:
titanic["pclass"] = pd.Categorical(titanic["pclass"])

In [12]:
titanic["sex"] = pd.Categorical(titanic["sex"])

In [15]:
titanic["deck"] = pd.Categorical(titanic["deck"])

In [9]:
titanic.shape

(891, 15)

## Tablas de contingencia de una variable

In [7]:
tab = pd.crosstab(index=titanic["survived"], columns="pasajeros")

In [8]:
tab

col_0     pasajeros
survived
0               549
1               342

In [10]:
type(tab)

pandas.core.frame.DataFrame

In [11]:
pd.crosstab(index=titanic["pclass"], columns="pasajeros")

col_0   pasajeros
pclass
1             216
2             184
3             491

In [13]:
pd.crosstab(index=titanic["sex"], columns="pasajers")

col_0   pasajers
sex
female       314
male         577

In [18]:
tab_c = pd.crosstab(index=titanic["deck"], columns="count")

In [17]:
titanic.deck

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

In [19]:
tab_c.sum()

col_0
count    203
dtype: int64

In [20]:
tab_c.shape

(7, 1)

In [22]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [23]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

## Tablas de contingencia de dos variables

In [25]:
survived_sex = pd.crosstab(index=titanic["survived"], columns=titanic["sex"])
survived_sex.index = ["died", "survived"]
survived_sex

sex       female  male
died          81   468
survived     233   109

In [30]:
survived_class = pd.crosstab(index=titanic["survived"],
                             columns=titanic["pclass"],
                             margins=True)
survived_class.index = ["murió", "sobrevivió", "total_clase"]
survived_class.columns = ["primera", "segunda", "tercera", "total_supervivencia"]
survived_class

             primera  segunda  tercera  total_supervivencia
murió             80       97      372                  549
sobrevivió       136       87      119                  342
total_clase      216      184      491                  891

### Frecuencias relativas globales

In [35]:
survived_class/survived_class.loc["total_clase", "total_supervivencia"]

              primera   segunda   tercera  total_supervivencia
murió        0.089787  0.108866  0.417508             0.616162
sobrevivió   0.152637  0.097643  0.133558             0.383838
total_clase  0.242424  0.206510  0.551066             1.000000

### Frecuencias relativas marginales

In [36]:
survived_class/survived_class.loc["total_clase"]

             primera   segunda   tercera  total_supervivencia
murió        0.37037  0.527174  0.757637             0.616162
sobrevivió   0.62963  0.472826  0.242363             0.383838
total_clase  1.00000  1.000000  1.000000             1.000000

In [41]:
survived_class.div(survived_class.loc["total_clase"], axis=1)

             primera   segunda   tercera  total_supervivencia
murió        0.37037  0.527174  0.757637             0.616162
sobrevivió   0.62963  0.472826  0.242363             0.383838
total_clase  1.00000  1.000000  1.000000             1.000000

In [37]:
survived_class.T/survived_class["total_supervivencia"]

                        murió  sobrevivió  total_clase
primera              0.145719    0.397661     0.242424
segunda              0.176685    0.254386     0.206510
tercera              0.677596    0.347953     0.551066
total_supervivencia  1.000000    1.000000     1.000000

In [38]:
survived_class.div(survived_class["total_supervivencia"], axis=0)

              primera   segunda   tercera  total_supervivencia
murió        0.145719  0.176685  0.677596                  1.0
sobrevivió   0.397661  0.254386  0.347953                  1.0
total_clase  0.242424  0.206510  0.551066                  1.0

### Tablas multidimensionales

In [44]:
survived_sex_class =  pd.crosstab(index=titanic["survived"],
                                  columns=[titanic["sex"], titanic["pclass"]],
                                  margins=True)
survived_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891